app/controllers/welcome_controller.rb

SELECT "printers".* FROM "printers"
---
  def index
    @printers = Printer.all